In [100]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [101]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [102]:
%matplotlib inline

In [103]:
from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import OneHotEncoder

In [104]:
dataframe = pd.read_csv('homeprices.csv')
dataframe.head(n=3)

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000

In [105]:
town_ohe = pd.get_dummies(dataframe.town)
town_ohe.head(n=3)

   monroe township  robinsville  west windsor
0                1            0             0
1                1            0             0
2                1            0             0

In [106]:
dataframe_without_town = dataframe.drop(labels='town', axis=1, inplace=False)
dataframe_without_town.head(n=3)

   area   price
0  2600  550000
1  3000  565000
2  3200  610000

In [107]:
## Keeping in mind multicollinearity, drop one of the hot encoded column from town_ohe dataframe
town_ohe_update_i = town_ohe.drop(labels='monroe township', axis=1, inplace=False)
town_ohe_update_i

    robinsville  west windsor
0             0             0
1             0             0
2             0             0
3             0             0
4             0             0
5             0             1
6             0             1
7             0             1
8             0             1
9             1             0
10            1             0
11            1             0
12            1             0

In [108]:
final_df = pd.concat([dataframe_without_town, town_ohe_update_i], axis=1)
final_df

    area   price  robinsville  west windsor
0   2600  550000            0             0
1   3000  565000            0             0
2   3200  610000            0             0
3   3600  680000            0             0
4   4000  725000            0             0
5   2600  585000            0             1
6   2800  615000            0             1
7   3300  650000            0             1
8   3600  710000            0             1
9   2600  575000            1             0
10  2900  600000            1             0
11  3100  620000            1             0
12  3600  695000            1             0

In [109]:
model = LinearRegression()
model.fit(final_df[['area', 'robinsville', 'west windsor']], final_df.price)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [110]:
model.predict(np.array([[2800, 0, 1]]))

array([605103.20361213])